1:WizQst80B8E
00000000

Raised Tower
00000001

Bottom of the Lake
00000002

 I was once like you, Ravenwood's most promising student.
00000003

I'll waste no more time on you! My destiny awaits, as the prophecy has foretold!
00000004

Watch and learn as I speak the Charm of Making...
00000005

With this, my power returns a hundred fold!
00000007

<ITALICS>That was a little unusual. It brought you to the bottom of the lake. Luckily, it also allowed you to breathe down here... </ITALICS>
00000008

<ITALICS>That figure ahead looks disturbingly familiar. </ITALICS>
00000009

Bottom of the Lake
00000010

I knew you'd come! She said you'd come! She knows you better than you know yourself!
00000011

It's up to me to stop you so you can't disrupt her ritual. You may have beaten me in our last duel, but she has given me new life!
00000012

Once you are destroyed, I'll take the path up to the top of Shining Mountain and rejoin my Lady of Shadows!
00000013

Noooooo! Dark Lady, do not abandon meeeeeeeeeee!
00000014

<ITALICS>Maybe that's the last of him... That must be the path up to the top of the mountain he mentioned. </ITALICS>
00000015

Mountain Path
00000016

You have grown in power, Wizard. I am impressed.
00000017

Imagine what I could teach you.
00000018

I offer you endless power. Think of what we could do. Join me...we can redraw the spiral itself.
00000019

No? Then I'll just destroy you... and do it alone.
00000020

Spectral Guardians of Shining Mountain - I am your master now. Destroy that Wizard!
00000021

Sit quietly and watch as I draw down the power of the Spiral and rewrite destiny. 
00000022

"Ah'nahl nathrak" <br>"Uth Vas Bethad" <br>"Do-Hiel Dienveh."
00000023

<ITALICS>There's a trace of magic in the air from her teleport spell. If you hurry up to it, you can follow her. </ITALICS>
00000024

Morganthe
00000025

<ITALICS>Morganthe must have entered the Sunken Tower now that its barriers have fallen. </ITALICS> 
00000026

Why do you oppose me? I am merely recovering that which is mine.
00000027

This treasure was stolen from me long, long ago. It is mine by right. 
00000028

I have done it! I have broken Ambrose's cursed locks and reclaimed what was rightfully mine.
00000029

And now I reclaim my Deck of Shadows.
00000030

Goodbye, young Wizard. My pets are hungry, and you will make an excellent snack.
00000031

If you happen to survive, tell your Headmaster he cannot stop me. He will hear the Horn when it calls.
00000032

<ITALICS>A deep tremor shakes your very being, and you hear a howling wind from outside... </ITALICS> 
00000033

The Mirror will break... the Horn will call. From the Shadows I strike, and the skies... will fall!
00000034

<ITALICS>You must return to Baobab at once and tell Inyanga Whitestripes what has transpired here today. </ITALICS> 
